{"http://www.hscast.com/": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery             Advanced Capabilities   State-of-the-art engineering and manufacturing.          Incomparable Value   Single source casting saves time & money.          Commitment To Quality   Proven, dedicated processes & teams.          Management Philosophy   Excellence in products, services, & support.          Harrison Steel Castings Company is a global leader in the production of highly engineered carbon and low/medium alloy steel castings. The production of precision-engineered steel castings not only requires a state-of-the-art manufacturing facility, it demands a complete understanding of each customer's unique requirements. Our capabilities, experience and commitment to quality ensure that each product achieves our second to none standards and exceeds our client's needs.    At Harrison Steel, we uphold one driving principle when providing cast solutions: Satisfy the Customer.   All New 29,000 sq. ft. Finish Machine Shop!           900 Mound Street Attica, IN 47918    (800) 659-4722 (765) 762-2481    Email Us   Request a Quote Today!         900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//contact": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Contact Us  Harrison Steel Castings Company  P.O. Box 60 900 Mound Street Attica, IN 47918-0060 T: 765.762.2481 800.659.4722 F: 765.762.2487  Deliveries  200 West Bond St. Attica, IN 47918  For sales, click here  For careers, click here             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//about": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          About Us  Driven by Continuous Improvement  More than 100 years ago, J.W. Harrison established the National Car Coupler Company in Attica, Indiana. Today, that company is Harrison Steel Castings Company , a world leader in the production of highly engineered carbon and low/medium alloy steel castings and a preferred supplier to many of the world's most prestigious names in agriculture, heavy equipment, energy, military, mining and the oil and gas industries.  A privately owned company, Harrison Steel operates a state-of-the-art, technology-driven international engineering and manufacturing organization. Our U.S. physical plant encompasses 650,568 square feet under roof and is capable of castings ranging from 350 to 12,500 pounds net casting weight. Sophisticated engineering software, tightly controlled manufacturing processes, superior quality programs, a motivated, non-union workforce, an emphasis on safety and a continuous improvement culture ensure our customers of the best results possible.  Get superior value and incomparable service with Harrison Steel.   Contact Us today.               900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//capabilities": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Capabilities    At Harrison Steel , our management philosophy revolves around excellence in products, service and support. We operate a state-of-the-art, technology-driven engineering and manufacturing facility based in Attica, IN. Our U.S. plant encompasses 650,568 square feet under roof and is capable of castings ranging from 350 to 12,500 pounds (net casting weight). We leverage sophisticated engineering software, tightly controlled manufacturing processes, superior quality programs and a motivated, non-union workforce to deliver second to none products and service.    The number one priority of the Harrison Steel organization is ensuring a safe workplace for all employees. We understand that the people of Harrison Steel are our best asset and for this to continue to be the case, Harrison Steel must provide a safe work environment and foster a culture where safety is never compromised. Harrison Steel also believes that it is has an inherent responsibility to be good stewards of the environment. Harrison Steel recycles nearly 50,000 tons of scrap steel every year and is constantly searching for manufacturing opportunities to reduce our environmental footprint. From a manufacturing standpoint, the Harrison Steel Castings management team works tirelessly to create a culture where decisions are based on data. Put in the simplest of terms; let the data dictate our daily actions. Harrison Production System is the program that drives lean manufacturing within Harrison Steel. Harrison Steel Castings will continue to be an organization that reinvests in its people and facilities, while also implementing the strategic plans necessary to support our mission and vision statements, all in an effort to: Satisfy the Customer.  “The management team at Harrison Steel has been very proactive to ensure that HS remains globally competitive. Their commitments to 5S, the initiative to make their quality systems more robust and the significant upgrade to their value add capabilities have been very impressive. In my opinion, HS is positioned to be an industry leader for many years to come.” – Casting Buyer, Energy Industry   More     Engineering      MagmaSoft  Pattern Shop  SOLIDCast  Pro-Engineering      Engineering Assistance  Solidification Analysis  Dynamic Fluid Flow  Stress Analysis     More        Harrison Steel's engineering team is responsible for developing the appropriate methods and design requirements for establishing molding processes. We utilize the most advanced three-dimensional engineering software available and the experience of our seasoned team of engineers to help predict performance and potential defects. Simulations of mold filling and solidification analysis help us \"see\" issues before a part is ever cast. This capability enables our engineers to leverage data in the design of molds and production processes so that they are correct from the start and end performance is assured. If there is a potential design flaw, we notify customers so that changes can be made before problems occur.  “The methods and rigging engineers at Harrison Steel are as good as you will work with in the industry. Their experience and willingness to collaborate on projects is something our organization has benefited from greatly.” – Casting Buyer, Mining Industry     Manufacturing/Production      Pattern Production  Electric Arc Furnace Melting  Phenolic Urethane Molding  Product Finishing Operations  Heat Treatment      Machining  Painting & Packaging Solutions  Facility Engineering & Maintenance  Material Capabilities     More        Harrison Steel Castings operates three electric arc furnaces with the flexibility of acid and basic melting practices. With tightly controlled processes, Harrison Steel assists customers around the world with precise manufacturing operations on our semi-automated and floor molding lines. Harrison Steel is vertically integrated. With our ability to complete all required heat treatment, NDE testing, rough machining, finish machining, painting and packaging operations on-site, Harrison Steel is poised to continue being an industry leader in providing Tier 1 casting solutions.  “Harrison Steel has been instrumental in helping our organization increase our build schedule. Our past due schedule was in real bad shape prior to partnering with Harrison Steel. Harrison Steel was able to dedicate resources, including finish machining, to bring our deliveries current, which resulted in increased revenue that we would have otherwise lost.” – Casting Buyer, Gas/Oil Industry     Quality Control      Harrison Production System  Mechanical Testing  Metallographic Testing  Chemical Testing      Magnetic Particle Testing  Radiographic & Ultrasonic Testing  ISO 9001:2008     More        At Harrison Steel, we relentlessly pursue quality in everything we do, every day. It's something we invest in, work on, and ultimately deliver to each customer. We employ a wide range of quality initiatives to support our culture of continuous improvement. In the process, we have successfully minimized variability and elevated quality in our manufacturing processes. Six Sigma (13 Black Belts), 8D, 5 Why, and Kaizen problem solving tools are employed to identify opportunities and strategies for improvement. From your initial new project with Harrison Steel, to your 100th year of doing business with our organization, you can be assured, quality will never be compromised.  “The APQP (Advanced Product Quality Planning) process at Harrison Steel is as comprehensive of a program that I have seen in the foundry industry when it comes to launching new projects. Without exception, it is a tool that separates Harrison Steel from many of its competitors.” – Casting Buyer, Mining Industry                900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//value": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Value Added  Harrison Steel is committed to reducing waste through continuous improvement and lean manufacturing principles. Ultimately, with our machining, engineering and NDT capabilities, Harrison Steel strives to be the highest value casting supplier in North America.  At a time when many foundries are cutting back, limiting the scope of their services and outsourcing portions of the casting process, Harrison Steel remains a full-service castings operation. We offer turnkey solutions that include:   Professional Engineering/Modeling (MagmaSoft, SOLIDCast)  Full Scale Commercial Pattern Shop  Metallurgical Testing  Melting  Normalize, Quench & Temper Heat Treat  Complete Non-Destructive Testing – Wet/Dry Magnetic Particle Inspection, UT, Gamma Ray, Electro Optical \u0003Dimension Verification  Domestic & International Solutions  ISO Q9001 Certified  Machining   The ability to utilize Harrison Steel as a Tier 1 casting supplier can save a significant amount of time and cost. Simplified project management, logistics and financial administration allow us to keep total landed cost down. This results in improved casting supplier value stream and we view that as a win-win. All of this equals added value to customers who want simplicity, efficiency and accuracy over complexity. Get superior value with Harrison Steel.  Contact us today.             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//quality": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Quality  Satisfy Your Customer  Quality at Harrison Steel Castings is synonymous with the value we are able to achieve for both our existing and potential new customers. Whether for new product or from a re-design of existing product, we embrace every opportunity to work with design engineers in the early stages to design for manufacturability of highly engineered, produceable product. To parallel the design, we are engaged with our customers from the quotation stages with specification discussions, thus mitigating any potential impact on production.  Our Advanced Product Quality Team (APQP) repeatedly excels in meeting the Milestones and Deliverables as agreed upon with our customers. Since the inception of this system, we have been late on only one deliverable and our customer was notified well in advance and a revised Project Plan was resubmitted, collaborated on and mutually agreed upon. We take great pride in providing our customers with weekly updates on our progress along with any foreseeable barriers.  Our Quality Policy which is “Satisfy Your Customer”, is achieved using Quality Systems which far exceed the ISO 9001-2015 Certification we enjoy. Elements of QS9000 (AIAG), TS16949 and TQM have been incorporated into our Quality Management System. Elements such as APQP, Contract Review and Long Term Strategic Planning have been introduced and implemented to insure that our customers continue to realize the delivered value we offer not only today, but in the years to come. These Systems then drive our Continuous Improvement teams in a never ending effort to achieve 100% Customer Satisfaction. Trust your next project to Harrison Steel Contact us to learn more.               900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//philosophy": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Philosophy  The Harrison Steel management team strives to achieve our primary mission of continuous improvement, quality focus and data driven actions. Our team also understands that the company’s success depends on the success of our employees, customers, investors, suppliers and community.  Key Drivers of Our Company   Safety  Lean Manufacturing  Value Added Solutions  Strategic Planning  Environmental Responsibility  Continuous Improvement Philosophy  Data Driven Management  Commitment to Employee Development  Community Focused   The number one priority of the Harrison Steel organization is ensuring a safe workplace for all employees. We understand that the people of Harrison Steel are our best asset and for this to continue to be the case, we must provide a safe work environment and foster a culture where safety is never compromised. Harrison Steel also believes that it is has an inherent responsibility to be good stewards of the environment. As a global company, Harrison Steel recycles nearly 50,000 tons of scrap steel every year and is constantly searching for manufacturing opportunities to reduce our environmental footprint. From a manufacturing standpoint, the Harrison Steel Castings management team works tirelessly to create a culture where decisions are based on data. Put in the simplest of terms; let the data dictate our daily actions.  Harrison Steel Castings will continue to be an organization that reinvests in its people and facilities, while also implementing the strategic plans necessary to support our mission and vision statements , all in an effort to: Satisfy the Customer.             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//gallery": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery           Gallery  Harrison Steel operates a state-of-the-art, technology-driven engineering and manufacturing facility based in Attica, IN. We leverage sophisticated engineering software, tightly controlled manufacturing processes, superior quality programs and a motivated, non-union workforce to deliver second to none products and service.     Pouring steel in flaskless molds     Pouring steel in flaskless molds     Pattern shop     Checking Temperature     Cleaning Room - Before     Cleaning Room - After     Mold wash being applied     Finish Machine Shop Expansion     New part in production     Pattern production     Mazak V100                           900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//machining": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          machining  Harrison Steel operates rough and finish machine equipment, giving our customers options on how cast parts are finished prior to delivery.  Our facility features three areas capable of machining castings up of 60,000 and 14,000 pounds, respectively. Our expert machine shops can meet specific tolerances from /- .75mm for rough machining to +/- .015mm for finish machining of assembly ready parts. Our Statistical Process Control (SPC) ensures we manufacture and machine each part as intended by our customer’s specifications.  The Finish Machining area incorporates the use of Master Cam with customer supplied models to generate CNC programs. We also have the capability to design and fabricate machining fixtures in house to reduce costs and lead times.  Capabilities   Rough Machining   Tolerances of +/- .75mm   Finish Machining   Tolerances of +/- .015mm   Machines   Seven vertical turning machines with swings up to 84-inches in diameter  Ten conventional engine lathes with swings up to 84-inches in diameter  Six Giddings & Lewis horizontal boring mills  Three multi-pallet horizontal machining centers  Multi-pallet vertical five-sided machining center  One CNC Engine Lathe up to 80\" swing  One 5 Axis vertical machining center  One 5 Axis turning center up to 92\" swing   Machines   Gauges are uniquely identified with individual serial numbers for \u0003trackability  Gauges are maintained and calibrated by certified Harrison Steel employees and in conjunction with a third party accredited calibration \u0003service  2 faro arms for dimensional inspection               900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//mission": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Mission & Vision   Our Mission Statement   To provide vertically integrated cast solutions through a philosophy of continuous improvement, quality focus and data driven actions. Harrison Steel's success will be defined by the success of our employees, customers, investors, supplier and community.   Our Vision Statement   Harrison Steel will be the leader in providing high value cast solutions to diverse markets. We will accomplish through a culture of continuous improvement, innovative problem solving, employee development and attention to customer satisfaction.             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//sustainability": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Sustainability   Harrison Steel is an Energy Star Partner and is an active participant in the U.S. Department of Energy’s Better Buildings Challenge. Harrison’s active Energy Reduction Team is lead by Certified Energy Manager, Kyle Long.     Harrison Steel is one of only four U.S. Steel foundries to be recognized Energy Star Partners.    Since 2009, Harrison Steel has cut energy use across-the-board by 13.43%. HS has accomplished this reduction mostly through:   High-efficiency lighting upgrades throughout the plant  Installation of Variable-Frequency Drives on large motors  Replacement of compressed air equipment with higher efficiency electric motors  Energy Audits     Harrison Steel is committed to responsible environmental stewardship programs and recycling efforts:   All modling sand is continuously reclaimed and reused via mechanical reclamation and two (2) 3 ton per hour thermal reclamation systems  Metallic slag and steel waste, shot blast dust, cardboard, paper, oil, and thousands of tons of steel scrap is recycled every year.  Harrison Steel has recently made the decision to eliminate harsh chemical parts cleaning solvents throughout its facility and replace them with only Environmentally friendly Bio-Solvents  Harrison Steel is currently in the trial process of a new, more environmentally friendly chemical binder system for molding. This new H.A. BioSet system produces as much as 30% fewer VOCs and a 25% reduction in CO during pouring, cooling, and shakeout processes.      Harrison Steel Employees are active members in various community sustainability boards including The Tippecanoe County Environmental Council, The Greater Lafayette Safety Council (GLASC), and the AFS Air Committee.   Recently received the 2013 GLASC “Best In Class” Safety Award               900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//quote": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery           Request a Quote               First Name    Last Name    Email    Company    Street    City    State/Province    Zip    Phone        Submit             900 Mound Street Attica, IN 47918   (800) 659-4722 (765) 762-2481   Email Us           900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//international": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          International  Harrison Steel offers our customers all the advantages of international sourcing with the security of a domestic supplier through our business unit, Harrison International.  Utilizing significant foundry experience and domestic management and engineering teams, Harrison International bridges the complexities of doing business offshore, simply and seamlessly. Our knowledge of government regulations, foreign language skills, established import and shipping relationships combined with our extensive operational, technical, sales and marketing experience in low cost country environments, we are able to provide low cost structure, qualified manufacturing processes, high quality and on-time delivery.  Harrison International covers all aspects of offshore foundry business including OEM and aftermarket parts and service. We leverage our technology and engineering expertise through strategic alliances with hand-selected, audited offshore foundries in China and Eastern Europe. We source and oversee castings for agriculture, construction, mining, oil and gas, pumps, valves, compressor, heavy truck and off-road vehicles.  Services   Transparent Project Oversight  Quality Assurance  Pattern Making (wood & aluminum)  Melting  Machining  Testing  Fabrication  Basic Assembly  Painting  Logistics   Materials & Weight Ranges   Medium/Low Alloy Steels  Most Carbon Steels   Our international foundries have a wide range of capabilities, both weight and material  Contact us to discuss your specific project             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//new": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Whats new?  Tapping Out Newsletter  Tapping Out January 2017 Edition    News  Harrison Steel featured in Manufacturing Today!  Finish Machine Shop Press Release:  Updated February 2013  ENERGY STAR Partnership  Now Providing Outsourced Machining Services for Steel Castings  Commercial Pattern Shop for Outside Customers Opened             900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//community": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Community Involvement  Harrison Steel is committed to keeping our community strong and vibrant. We are proud to be involved with the following programs, activities and initiatives.   Fountain/Warren Musical Arts   4 performances per year  Low cost for adults, free to students  Classical, Jazz, Dixieland, Standards, etc.   Summer Tennis Program   3 weeks  Grades 3-11  No charge   $1000 Scholarships   Wade C. Harrison Memorial  Harrison Steel Castings  Attica High School graduating Senior   Happy Walter Field   Used for summer tee ball, baseball, softball   Time & Monetary Donations   Area schools  Area park programs  Area Sharing Kindness (ASK)  Attica Violin Program  Area Police & Fire Departments  Baseball/Softball leagues  Senior Centers  Relay for Life  Libraries  IU & Purdue  Athletic Boosters   & many others!              900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//careers": "              About Us  Capabilities  Value Added  Quality  Philosophy  Gallery          Careers     Are you ready for Shift Work?    At Harrison Steel, we match the best applicants with the right jobs.    Long-time manufacturing pros and career-changers sign on with us to improve their paychecks and skills. We welcome anyone who enjoys hard work and who shows up on time, especially independent thinkers and innovative leaders.    Fill out our general application , if you lack significant heavy manufacturing experience or your skills match multiple job listings. For construction, foundry and metal working experts, and other professionals, take a minute to browse our job listings, where we explain the requirements to join our highly specialized, cross-trained team .    Before you Apply  We dedicate countless hours to on-site training, to protect employees' safety and our reputation for continuous improvement.    Employees occasionally or regularly lift 10 to 70 pounds, as part of the day's labor. We work in conditions that range from extreme cold to extreme heat, inside and outdoors. Our jobs are tough. We do hard work. And we take pride in producing quality products.    The Benefits of Working for Us  Quality of life comes first at Harrison Steel. We are family owned, by the same family, since 1906. Many current employees began careers here decades ago, and their children and grandchildren have followed in their footsteps.    Our wages compare favorably with other employers in the steel industry and among local manufacturers. Available benefits include full medical, vision and dental plans, vacation, 401k and profit sharing. The WeCare Clinic is available free of charge to employees enrolled in our medical benefits program and their dependents.    About Harrison Steel  Harrison Steel workers have created high-quality steel castings, right here in Attica, Indiana, for more than 100 years. Our dynamic, highly specialized processes and dedication to Satisfying the Customer make the foundry a leading producer of castings for the agricultural, mining and energy industries. We are an equal employment opportunity employer.    Click here to see the full job listings and apply; it only takes about 5 minutes!               900 Mound St. | Attica, IN 47918  (800) 659-4722 | (765) 762-2481  Email Us or Join Our Newsletter       About Us  Capabilities  Request a Quote  Gallery      Quality  Philosophy  Value Added  International      Whats New?  Community Involvement  Careers  Contact Us             ", "http://www.hscast.com//assets/css/styles.css": "", "http://www.hscast.com//assets/css/sidebars.css": ""}