{"https://www.tmfcenter.com": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  TMF Center will provide our customers with high quality, competitively priced products that are manufactured consistently on time while continually improving our quality management system.            Not risk-adverse to purchasing mill buys of special material  ​  A Creative approach to new business and processing       Financially positioned to compete  ​  Quality, Delivery, Cost and Creativity            A Highly motivated work force  ​  ​  A strong customer focused company culture          ", "https://www.tmfcenter.com/": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  TMF Center will provide our customers with high quality, competitively priced products that are manufactured consistently on time while continually improving our quality management system.            Not risk-adverse to purchasing mill buys of special material  ​  A Creative approach to new business and processing       Financially positioned to compete  ​  Quality, Delivery, Cost and Creativity            A Highly motivated work force  ​  ​  A strong customer focused company culture          ", "https://www.tmfcenter.com/history": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  About  TMF Center is a technology-based manufacturing company based in rural, west-central Indiana.  Founded in 1977 in Illinois, TMF moved to Williamsport, Indiana in 1994 due to the more favorable business climate in Indiana.  Since moving to Indiana, TMF Center has grown from annual sales of $5 million to over $50 million.  As a family-owned business TMF Center strives to contribute to the local economy with over 225 employees today.  ​  TMF Center produces component parts for manufactures of off-highway construction equipment, the mining industry, and heavy duty trucking.  TMF’s customers demand world-class processes and systems to support those products. They also require pricing that will compete on a global scale.  In order to meet their needs, TMF must have the right equipment and the best staffing operating in a favorable business climate within the community.  ​  TMF produces components made from steel bar, steel plate and castings.  The process includes CNC machining (over 100 machines), robotic welding, welding, powder coat painting, grinding, heat treatment, sawing and forming.  TMF Center has a second plant that specializes in high volume component manufacturing.  ​  Our strategy to compete globally is based on the implementation of advanced technology and manufacturing methods in a business-friendly community.  Our local community has people available with good work skills, and personal character to help a business succeed.  ​  ​  Address: 300 W. Washington Street  Williamsport, IN 47993  ​  Phone:    765-762-1000          ", "https://www.tmfcenter.com/steel": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Steel  Flat and Round Bar  Our steel is purchased to customer specifications in mill buy quantities when needed.  We have a maintained inventory of over 50 sizes of metric flat bar stock  We also have many sizes stocked in ASTM 572 GR50 and other hard to find steel grades.  This can be a significant cost advantage compared to grade 50 parts burned from plate  ​  Steel Tubing  We inventory round and square tubing ranging in size from 1 inch to 12 inches.  We also produce a wide variety of fabrications that include tubing as a component.  ​       Plate Steel  TMF purchases steel plate in mill direct truck load quantities.  We stock over 48 different thicknesses and grades ranging from 8mm up to 5 inches with a mix of inch and metric stock to meet our customers needs  ​ ​     ", "https://www.tmfcenter.com/cnc-machining": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  CNC Machining  CNC Machining is a process used in the manufacturing sector that involves the use of computers to control machine tools. Tools that can be controlled in this manner include lathes, mills, routers and grinders. The CNC in CNC Machining stands for Computer Numerical Control.   Under CNC Machining, machine tools function through numerical control. A computer program is customized for an object and the machines are programmed with CNC machining language (called G-code) that essentially controls all features like feed rate, coordination, location and speeds. With CNC machining, the computer can control exact positioning and velocity. CNC machining is used in manufacturing both metal and plastic parts.   There are many advantages to using CNC Machining. The process is more precise than manual machining, and can be repeated in exactly the same manner over and over again. Because of the precision possible with CNC Machining, this process can produce complex shapes that would be almost impossible to achieve with manual machining. CNC Machining is used in the production of many complex three-dimensional shapes. It is because of these qualities that CNC Machining is used in jobs that need a high level of precision or very repetitive tasks.   TMF offers a variety of CNC Machining options. Click below to learn more about our services.  ​  Vertical  Horizontal  Turning  High Speed Drill Tap  5 Axis Machining  Custom Shaped Bar            ", "https://www.tmfcenter.com/fabrication": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Fabrication  The TMF Center offers a variety of Fabrication options to fit your needs. Click the links below to find out more:  ​  Sawing  Forming  Welding  Painting  Roll Forming  Robotic Oxy-Fuel  Shot Blasting  ​            ", "https://www.tmfcenter.com/quality": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Quality Control  Quality is an important factor in every process at TMF. Please visit the following links to see how we strive to meet required standards and your expectations:  ​  ISO Certified  Advanced Quality System  Quality Metrics  CMM's  Romer Arms  Certified Weld Process            ", "https://www.tmfcenter.com/employment": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Employment at TMF  We offer a wide variety of competitive employee benefits:  •401k  •Short Term Disability plan  •Life Insurance and AD&D  •Health Reimbursement Account (HRA)  •Flexible Spending Account (FSA)  ​  We offer the following benefits to our employees and their families as well:  •Group Medical Plan  •Vision Plan  •Dental Plan  •Voluntary Life Insurance  TMF Center is an Equal Opportunity Employer  ​  TMF Center Inc. is looking for result-oriented individuals to help us meet the needs of our industry in the following positions:  •Horizontal Machine Operator  •Vertical Machine Operator  •CNC Machine Operator  •5-Axis Machine Operator  •Welders  •Painters  •General Laborers   Employee  ​ Login/Sign up Interested parties may email a resume and completed Employment Application to Inquiries@TMFCenter.com  Or apply in person with our office at  300 W Washington St,  Williamsport, IN 47993  ​  Any offers of employment are conditional, based on drug screen.  ​              ", "https://www.tmfcenter.com/contact-1": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Contact Address: TMF Center  300 W Washington Street  Williamsport IN, 47993  ​  Phone: 765-762-1000 Send         ", "https://www.tmfcenter.com/contact": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com     ", "https://www.tmfcenter.com/verticle": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Vertical CNC Machines  ​ TMF Center has over 40 vertical machining centers ranging size from 20x20x40 to 40x150x40. Our wide range of equipment allows us to use the machine with lowest cost required to meet the needs of the part we are making. Too often in the contract parts manufacturing industry, companies are forced to put a small part on a large machine. This is either inefficient to the supplier or unfair to the customer.         ", "https://www.tmfcenter.com/horizontal": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Horizontal CNC Machines  TMF has over 30 horizontal CNC machines ranging in size from 20x20x24 to 1000x1200x1600mm. Our wide range of equipment allows us to use the machine with lowest cost required to meet the needs of the part we are making. We have 4 FMS style pallet pool systems with dedicated fixtures that allow us to produce any part in any quantity with no setup cost.         ", "https://www.tmfcenter.com/turning": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Turning  TMF operates over 30 turning centers. With swing diameters ranging from 10 inch to 40 inch. Approximately half of our lathes are equipped with live tooling and y- axis capabilities. We have the right size/cost machine for nearly every application.           ", "https://www.tmfcenter.com/high-speed-drill-tap": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  5 Axis Machining  TMF center has been involved in 5 axis machining from the time the technology emerged and became commercially available. We currently operate fifteen 5 axis machining centers. These machines can be very cost effective in making a part in one operation that traditionally would need to be processed on two or more machines.    This shows the anatomy of a 5 axis machine, the advantages in accessing a complex part are easy to understand with this view.          ", "https://www.tmfcenter.com/5-axis-machining": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  High Speed Drill Tap  •TMF operates 6 high speed machines that allow us to drill and tap a hole for a very low cost.  We produce over 2000 different part numbers made from flat steel bar stock.          ", "https://www.tmfcenter.com/custom-shaped-bar": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Custom Shaped Bar  For 20 years we have been the company of choice for part specific steel bar sizes in specific metallurgical chemistries. Building on that foundation we now offer machined custom shaped bar. These components are used in complex fabrications and have traditionally been costly to purchase and the tooling to roll this type of product is often not justifiable from an ROI standpoint. With the advancements in machining and tooling we can now provide this product at a lower cost by starting with standard bar or plate and machining the desired shape.    From This...  To This.          ", "https://www.tmfcenter.com/sawing": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  CNC Sawing  TMF operates 8 CNC saws with size ranging up 14 inch square. We have miter saws and high performance CNC cold saws. We use formula pricing for our production saw work based on the cross sectional area of the part.  This makes our saw cost very competitive.            ", "https://www.tmfcenter.com/forming": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Forming  TMF Center has several forming and straightening press’s for high or low volume parts. We specialize in removing bow, camber and twist from parts that are made from bars up to 3000mm.              ", "https://www.tmfcenter.com/welding": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Welding  TMF has a certified weld process that includes the testing of each weld and the certification of each welding machine. Once the parameters for a particular weld are certified all welds within the company will be performed with those same parameters.  ​  TMF operates 12 robotic welding systems on a variety of part families.          ", "https://www.tmfcenter.com/painting": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Painting  TMF has two powder paint lines that have been rated best in class by our customers. We can paint to nearly all specifications on parts ranging up to 2 meters cubed.           ", "https://www.tmfcenter.com/roll-forming": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Roll Forming and Ring Production  TMF has developed a process for producing roll form parts and rings. We produce thousands of parts per year. With our ring making we can produce parts that are round within .5mm and on diameter within .5mm              ", "https://www.tmfcenter.com/robitic-welding": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Robotic Welding  We use a robotically controlled oxy fuel cutting torch on flat bar to perform certain operations at a lower cost than could done on a CNC machine. This is a big savings compared to burning from plate we save the burn cost and have no cost penalty due to the nesting.            ", "https://www.tmfcenter.com/shot-blasting": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Shot Blasting    2 Tumbler    3 Table Blast machines up to 100 inch    2 Pass through    We price all shot blast services based on formula per lb pricing.                ", "https://www.tmfcenter.com/iso-certified": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  ISO Certified  TMF Centers Quality Management System has been ISO Certified since October 2006. Our current ISO Certification is to the ISO 9001:2008 Standard.            ", "https://www.tmfcenter.com/advanced-quality-system": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Advanced Quality Systems  TMF incorporates various tools to ensure Quality is a key focus for both standard processes as well as process improvement.  •APQP  •Standard Work  •Statistical Process Control (CPK Analysis)  •8D Corrective Action  •Root Cause Analysis  •Process Audits  •Gage Calibration  •ISO 9001:2008  •Weld Excellence Process and Audits  •CAV Industrial Paint Audits          ", "https://www.tmfcenter.com/low-ppm": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  QMS Metric Tracking  As a process control tool TMF Center also monitors and tracks all major metrics for both production and quality.  •PPM  •Pareto of Defects  •Percentage of $ Rejected  •On-time Deliver  •On-Time PPAP Submission  •Plant Efficiencies            ", "https://www.tmfcenter.com/cmm-s": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Coordinate Measuring Machines  TMF Center currently utilizes 5 Coordinate Measuring Machines with individually trained CMM operators for multi-axis inspection.  CMM’s are calibrated yearly by a third party calibration team.            ", "https://www.tmfcenter.com/romer-arms": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  Romer Arms  TMF Center also incorporates 2 Romer Measurement Arms for mobile inspection of larger parts.  Romer Measurement Arm capabilities are similar to that of a CMM.            ", "https://www.tmfcenter.com/certified-weld-process": "    TMF  Home About Us Steel CNC Machining Fabrication Quality Employment Contact More Center  CONTACT US  ​  Address: TMF CENTER Phone: 765-762-1000  300 W. Washington Street  Williamsport, IN 47993   © 2016 TMF Center. Proudly created with Wix.com  ​  TMF Center has had customer based Weld Excellence Certification since 2008.  TMF Weld Certification incorporates Certified Weld Instructor (CWI) tested and approved welds of all sizes as well as the settings needed to obtain these welds repeatedly.  Layered weld audits, defect identification, and approved materials also incorporated into the certification and everyday process.  Certified Weld Process          "}